/*Задание 1. Оказывается, не все люди умеют вычислять квадрат чисел. А ведь это просто необходимо! Буквально каждый день, а то и не один раз, нам нужно вычислить квадрат какого-нибудь числа.

Напишите программу, которая вычисляет квадрат числа. Пользователь должен ввести число (a), а программа выводит квадрат числа (a * a).*/
#include <iostream>
int main() {
  int a;
  std::cout << "Здравствуйте, это программа для вычесления квадратf числа \n" << "======================================================================= \n" << "Введите число : ";
  std::cin >> a;
  int result = a * a;
  std::cout << "Квадрат заданного числа равен : " << result ;
  
}