/*Задание 1
Напишите программу, в которой пользователю нужно ввести имя персонажа и расу, а программа выводит приветствие.
Например, если пользователь выбирает имя Солнышко, а расу Орк, программа должна написать:

“Родился новый Орк, его зовут Солнышко. Добро пожаловать в этот суровый мир!”.*/
#include <iostream>
int main() {
  std::string name;
  std::string species;
  std::cout << "Введите имя вашего персонажа :";
  std::cin >> name;
  std::cout << "Введите расу вашего персонажа :";
  std::cin >> species;
  std::cout << "На свет появился новая раса " << species << ". Его зовут " << name << ".Добро пожаловать в этот суровый мир!";
}