/*Задача 1. Калькулятор скидки.
Вы покупаете 3 товара в магазине. Если сумма вашего чека превышает 10 000 руб, вам будет сделана скидка 10%. Напишите программу которая запрашивает 3 стоимости товара и вычисляет сумму чека.*/
#include <iostream>
int main() {
  int productOne, productTwo, productThree, sum;
  std::cout << "Введите стоимость первого товара: ";
  std::cin>>productOne;
  std::cout << "Введите стоимость второго товара: ";
  std::cin>>productTwo;
  std::cout << "Введите стоимость третьего товара: ";
  std::cin>>productThree;  
  sum = productOne+productTwo+productThree;
  if(sum > 10000){
    sum *= 0.9;
  }
  std::cout << "Стоимость ваших покупок равна: " << sum;
}