/*Задача 2. Автомобиль.

Автомобиль выехал из Москвы в Рязань. Напишите программу, которая вычисляет сумеет ли добраться автомобиль до Рязани за два часа с заданной пользователем средней скоростью движения. Программа должна выводить вычисленное расстояние, а если автомобиль сумеет добраться до Рязани, - сообщение “Вы приехали”. Расстояние между городами - 200 км.*/
#include <iostream>
int main() {
  int speed, distance;
  std::cout << "Введите вашу среднюю скорость автомобиля в км/ч : ";
  std::cin >> speed;
  distance = 200;
  if(speed * 2 >= 200){
    std::cout << "Вы приехали";
  }
  else
    std::cout << "Вы проехали: " << speed*2 << "км";
}