/*Задача 3. Модуль числа.

Напишите программу, которая вычисляет модуль числа.

Подсказка: чтобы обратить знак числа в переменной ‘x’ надо писать вот так: x = - x.

*/
#include <iostream>
int main() {
  int a;
  std::cout << "Ввдете число: ";
  std::cin >> a;
  if(a<0){
    a = -a;
    std::cout << "Модуль вашего числа равен : " << a;
  }
  else
  std::cout << "Модуль вашего числа равен : " << a;
  
}
