/*Задача 3. Високосный год (необязательная). 

Напишите программу, которая определяет количество дней в году.


Подсказка: номер года должен делиться на 4, однако если он делится на 100, но не делится на 400, то год не високосный!
*/
#include <iostream>
using namespace std;

int main(){
  int years;
  cout << "Введите год : "; cin >> years;
  if (years < 4) cout << "ошибка";
  else if (years / 4 % 2 == 0)
    cout << "В этом году 366 дней";
  else cout << "В этом году 365 дней";
  
}
