/*Задача 4. Совпадение чисел(необязательная).

Напишите программу, которая по трем введенным числам a, b, c определяет, сколько среди них совпадающих чисел.

Подсказка: Совпадающих может быть 0, 2 или 3. Например, если введены числа 5 1 5, то ответ должен быть “2 совпадающих”, если -1 -2 -3, то ответ должен быть “0 совпадающих”.*/
#include <iostream>
using namespace std;
int main(){
  int a,b,c,result;
  result = 0;
  cout << "Введите 3 числа через enter: "; cin >> a >> b >> c;
  if (a == b) result += 1;
  if (a == c) result +=1;
  if (b == c) result +=1;

  if (result == 1 ) result += 1;

  cout << "в заданных цыфрах " << result << " совпадающих значений. ";
  }