/*Задача 2. Мост и перегрузка.

Через мост разрешено проезжать машинам с массой не больше 1200 килограмм. Для контроля на каждой полосе на въезде расположены весы. Одновременно на мост въезжает 4 машины.

Напишите программу, которая получает 4 числа — массу въезжающих машин — и сообщает, есть ли среди них хоть одна, вес которой превышает 1200 килограмм.*/
#include <iostream>
using namespace std;
int main(){
  int massAuto1,massAuto2,massAuto3,massAuto4;
  
  cout << "Введите массу первого автомобиля: "; cin >> massAuto1; cout << "\n"; 
  cout << "Введите массу второго автомобиля: "; cin >> massAuto2; cout << "\n"; 
  cout << "Введите массу третьего автомобиля: "; cin >> massAuto3; cout << "\n"; 
  cout << "Введите массу четвертого автомобиля: "; cin >> massAuto4; cout << "\n"; 

  if (massAuto1 > 1200 || massAuto2 > 1200 || massAuto3 > 1200 || massAuto4 > 1200)
    cout << "Вес одной из машин превышает!";
  else
    cout << "Всё ок";
}