/*Задача 1. Военкомат.

Для отбора летчиков устанавливаются жесткие критерии.

Напишите программу, проверяющую, подходит ли призывник. Его рост должен быть не меньше 145см и не больше 165см, вес не меньше 45кг и не больше 65кг, а количество рук и ног должно обязательно совпадать (мы не знаем, зачем, но так требует инструкция). При этом берут любого человека, налетавшего на самолетах больше 100 часов.

Дополнительно.

А еще зеленоглазых в летчики тоже не берут, поэтому проверьте и цвет их глаз.

Подсказка: для цвета глаз используйте строковый тип данных. Проверять строки на равенство можно так:
if (eyeColor == “серо-буро-малиновый”) { … }
*/
#include <iostream>

using namespace std;

int main() {
  int height, weight, numberHands, numberLegs, experience;
  string eyeColor;

  cout << "Введите ваш рост CM: "; cin >> height; cout << "\n";
  cout << "Введите ваш вес KG: "; cin >> weight; cout << "\n";
  cout << "Введите ваше колличество рук: "; cin >> numberHands; cout << "\n";
  cout << "Введите ваше колличество ног: "; cin >> numberLegs; cout << "\n";
  cout << "Введите ваш стаж полетов на самолете в часах: "; cin >> experience; cout << "\n";
  cout << "Введите цвет ваших глаз : "; cin >> eyeColor; cout << "\n";

  if((height >= 145 && height <= 165) && (weight >= 45 && weight <= 65) && (numberLegs == numberHands) && (experience >= 100) && (eyeColor != "Зеленый")){
    cout << "Вы подходите";
  }
  else cout << "Вы не подходите"; 