/*Задача 2. — Входит... И выходит... И входит... Замечательно выходит! "Винни-Пух и день забот".

У Винни-Пуха есть кирпич размера A на B на C. А еще есть стена, в которой проделано прямоугольное отверстие размера X на Y. Прежде чем подарить все это ослику Иа, Винни-Пух хочет знать, получится ли просунуть этот кирпич в это отверстие? Напишите программу, которая по данным пяти числам отвечает на этот вопрос. Разумеется, кирпич можно поворачивать.
*/
#include <iostream>

using namespace std;

int main() {
  int a , b , c , x , y;
  cout << "Введите ширину кирпича: "; cin >> a; cout << "\n";
  cout << "Введите глубину кирпича: "; cin >> b; cout << "\n";
  cout << "Введите высоту кирпича: "; cin >> c; cout << "\n";
  cout << "Введите ширину отверстия в стене: "; cin >> x; cout << "\n";
  cout << "Введите высоту отверстия в стене: "; cin >> y; cout << "\n";

  if((a <= x && c <= y) || (a <= y && c <= x) || (b <= y && a <= x))
    cout << "пролезет";
  else cout << "NO";
}