/*Задача 1. Симулятор маршрутки
Что нужно сделать
Напишите программу, которая симулирует работу маршрутки. Она умеет объявлять остановки и узнавать у пользователя, сколько человек вышло и зашло на остановке. Пассажиры оплачивают проезд при входе. Работать она должна примерно так:

Прибываем на остановку «Улица программистов». В салоне пассажиров: 0

Сколько пассажиров вышло на остановке? 0

Сколько пассажиров зашло на остановке? 3

Отправляемся с остановки «Улица программистов». В салоне пассажиров: 3

-----------Едем---------

Прибываем на остановку «Проспект алгоритмов». В салоне пассажиров: 3

…

…


Маршрут состоит из четырёх остановок. Напишите программу так, чтобы в конце она выводила, сколько денег мы заработали при условии, что билет стоит 20 руб., а расходы следующие:

четверть — на зарплату водителю;
пятая часть — на топливо;
пятая часть — на налоги;
пятая часть — на ремонт машины.
Формат вывода (после прибытия на последнюю остановку):

Всего заработали: 100 руб.

Зарплата водителя: 25 руб.

Расходы на топливо: 20 руб.

Налоги: 20 руб.

Расходы на ремонт машины: 20 руб.

Итого доход: 15 руб.*/


#include <iostream>
int main() {
  int totalNumberPassengers = 0;
  int numberPassengersOUT = 0;
  int numberPassengersIN= 0;
  int totalCash = 0;
 
  std::string busStop1 = "Улица программистов";
  std::string busStop2 = "Проспект алгоритмов";
  std::string busStop3 = "Площадь информатики";
  std::string busStop4 = "Памятник процессору";

  std::cout << "Выезжаем, движемся к остановке - " << busStop1 << "\n" <<  " Пассажиров внутри: " << totalNumberPassengers << "\n" << "введите кол-во новых пассажиров: ";
  std::cin >> numberPassengersIN;
  totalCash = totalCash + (20 * numberPassengersIN);
  std::cout << "Введите кол-во вышедших пассажиров: ";
  std::cin >> numberPassengersOUT;
  totalNumberPassengers = totalNumberPassengers + numberPassengersIN - numberPassengersOUT;

  
  std::cout << "Выезжаем, движемся к остановке - " << busStop2 << "\n" << " Пассажиров внутри: " << totalNumberPassengers << "\n" << "введите кол-во новых пассажиров: ";
  std::cin >> numberPassengersIN;
  totalCash = totalCash + (20 * numberPassengersIN);
  std::cout << "Введите кол-во вышедших пассажиров: ";
  std::cin >> numberPassengersOUT;
  totalNumberPassengers = totalNumberPassengers + numberPassengersIN - numberPassengersOUT;
  
  std::cout << "Выезжаем, движемся к остановке - " << busStop3 << "\n" <<  " Пассажиров внутри: " << totalNumberPassengers << "\n" << "введите кол-во новых пассажиров: ";
  std::cin >> numberPassengersIN;
  totalCash = totalCash + (20 * numberPassengersIN);
  std::cout << "Введите кол-во вышедших пассажиров: ";
  std::cin >> numberPassengersOUT;
  totalNumberPassengers = totalNumberPassengers + numberPassengersIN - numberPassengersOUT;

  std::cout << "Выезжаем, движемся к остановке - " << busStop4 << "\n" <<  " Пассажиров внутри: " << totalNumberPassengers << "\n" << "введите кол-во новых пассажиров: ";
  std::cin >> numberPassengersIN;
  totalCash = totalCash + (20 * numberPassengersIN);
  std::cout << "Введите кол-во вышедших пассажиров: ";
  std::cin >> numberPassengersOUT;
  totalNumberPassengers = totalNumberPassengers + numberPassengersIN - numberPassengersOUT;
  
  int driverSalary = totalCash / 4;
  int tax = totalCash / 5;
  int repair = totalCash / 5;
  int cash = totalCash - driverSalary - tax - repair;
  
  std::cout << "Всего заработали: " << totalCash << "\n" << " ЗП водилы: " << driverSalary << "\n" << " Налоги " << tax << "\n" << " Ремонт: " << repair << "\n" << " Чистая прибыль за день составила: " << cash;
  
}