/*Задание 4. Непонятная квитанция
Что нужно сделать
Управляющая компания рассылает странные квитанции: в них указана только полная стоимость ремонта многоквартирного дома, а сколько должна платить конкретная квартира — непонятно. Напишите программу, с помощью которой жители квартир смогут посчитать, какую сумму им надо заплатить. Сумма делится на все квартиры вне зависимости от площади, количества жильцов и комнат. Все значения сохраните в переменные и выводите в нужных местах, имитируя ввод данных.*/
#include <iostream>
int main() {
  int sumEntrance = 6;
  int sumFlatEntrance = 100;
  int sumFlat = sumFlatEntrance * sumEntrance;
  int totalMoney = 10000000;
  int result = totalMoney / sumFlat;
  std::cout << "Здравствуйте\n" << "============================\n"   << "\n" << "Всего подъездов: " << sumEntrance  << "\n" << "Всего квартир в каждом подъезде: " << sumFlatEntrance  << "\n" << "Сумма квартир в вашем доме равна: " << sumFlat << "\n";
  std::cout << "============================\n" << "Каждая квартира должна оплатить по " << result << " рублей ";
}