/*Задание 2. Майские!
Что нужно сделать
Напишите программу-календарь для мая. Она должна проверять введённый номер дня и сообщать, выходной этот день или рабочий. 

Условие:

Выходными считаются все субботы и воскресенья, а также даты с 1 по 5 и с 8 по 10 мая включительно. 
Месяц всегда начинается с понедельника.
Советы и рекомендации
Постарайтесь не проверять каждое число отдельно. 
Некоторые условия можно объединить.
*/
#include <iostream>
using namespace std;

int main() {
    int day, saturday, sunday;
    saturday = 13; 
    sunday = 14;
    cout << "Введите день мая: ";
    cin >> day;
    if (day > 10) {
        if (day != saturday && day != sunday) {
            saturday += 7;
            sunday += 7;
            if (day != saturday && day != sunday) {
                saturday += 7;
                sunday += 7;
                if (day != saturday && day != sunday) {
                    cout << "День рабочий";
                } else {
                    cout << "День выходной";
                }
            }
        }
    } else {
        cout << "День выходной";
    }
}