/* Задание 3. Время, время!
Что нужно сделать
Напишите программу для ресторана быстрого питания «Крылышки и ножки». Компания хочет знать, какое количество клиентов успеет обслужить один кассир за рабочую смену. Время на обслуживание складывается из времени, за которое клиент делает заказ, и времени, за которое кассир собирает заказ и выдаёт его клиенту. Все расчёты проводите в минутах. Все значения сохраните в переменные и выводите в нужных местах, имитируя ввод данных.*/

#include <iostream>
int main() {
  int timeWorkHours = 12;
  int timeWorkMin = 60 * timeWorkHours;
  int vremNaPrinMin = 2;
  int vremNaZakazMin = 15;
  int vremObsl = vremNaPrinMin + vremNaZakazMin;
  int result = timeWorkMin / vremObsl;
  std::cout << "Здравствуйте\n" << "============================\n" << "Смена вашего сотрудника равна: " << timeWorkHours << " часов или " << timeWorkMin << " мин. \n";
  std::cout << "============================\n" << "Ваш сотрудник сможет обслужить за смену " << result << " поситителя ";
}