/*Задание 1. Минимум из двух чисел
Что нужно сделать
Напишите программу, которая ищет минимальное значение из двух чисел.*/

#include <iostream>
using namespace std;

int main(){
  int a,b;
  cout << "Введите первое число ";
  cin >> a;
  cout << "Введите второе число ";
  cin >>  b;
  if (a > b){
    cout << "Число " << b << " Минимальное";
  }
  else if (a < b) {
    cout << "Число " << a << " Минимальное";
    }
  else if (a==b){
    cout << "Числа равны =)";
  }
  }
