/*Задание 1. Полёт нормальный!
Что нужно сделать
Напишите программу для аэропорта, проверяющую, правильным ли эшелоном летит самолёт. 

Условие:

скорость самолёта должна быть в диапазоне от 750 до 850 км/ч;
высота — в диапазоне от 9 000 до 9 500 метров.
*/
#include <iostream>

using namespace std;

int main() {
  int speed, height;
  cout << "Введите скорость самолёта: "; 
  cin >> speed;
  cout << "Введите высоту самолёта: "; 
  cin >> height;
  if ((speed >= 750 && speed <= 850) && (height >= 9000 && height <= 9500)) cout << "OK";
  else cout << "самолет летит неверным курсом";
}