/*Задача 3. Злостные вредители
Что нужно сделать
На бамбуковой плантации завелись гусеницы. Они спят днём и едят бамбук ночью. Бамбук генно-модифицированный, растёт только при свете дня, зато очень быстро — по 50 сантиметров ежедневно! Гусеницы съедают 20 сантиметров бамбука каждую ночь. Бамбуковые саженцы при посадке утром имеют высоту один метр. 

Напишите программу, которая считает, какой высоты будет бамбук в середине третьего дня. Усложнение — посчитайте это не за несколько подходов, а одной формулой.
*/
#include <iostream>

int main() {
    int dailyGrowth, nightFade, beginHeight, result;

    std::cout << "Введите начальную высоту бамбука: ";
    std::cin >> beginHeight;
    std::cout << "Введите на сколько см бамбук растёт ежедневно: ";
    std::cin >> dailyGrowth;
    std::cout << "Введите размер см съедаемого за ночь жуками: ";
    std::cin >> nightFade;
    result = (beginHeight + (dailyGrowth - nightFade) * 2 + (double) dailyGrowth / 2);
    std::cout << "Высота бамбука на середину 3 дня равна: " << result;

}
