/*Задание 3. Проверка на чётное число
Что нужно сделать
Напишите программу, которая проверяет, чётное ли число ввел пользователь.*/

#include <iostream>
using namespace std;

int main(){
  int a;
  cout << "Введите  число ";
  cin >> a;
  if (a%2 ==0){
    cout << "Ваше число чётное ";
  }
  else{
    cout << "Ваше число НЕ чётное ";
  }
}
