/*Задание 4. Калькулятор опыта
Что нужно сделать
Напишите программу, которая определяет уровень персонажа в компьютерной игре. Пользователь вводит число «очков опыта», а программа вычисляет уровень. Новый уровень даётся при достижении 1000, 2500 и 5000 «очков опыта». Начальный уровень равен 1.*/

#include <iostream>
using namespace std;

int main(){
  int points;
  /*
  int level1 = 1000;
  int level2 = 2500;
  int level3 = 5000;
  */
  cout << "Введите количество очков опыта :";
  cin >> points;
  cout << "-----Считаем----- " << "\n"; 
  if (points <= 2499 && points >= 0){
    cout << "Ваш уровень 1 ";
  }
  else if (points >= 2500 && points < 4999){
    cout << "Ваш уровень 2 ";
  }
  else if(points >= 5000){
    cout << "Ваш уровень 3 ";
  }
  else if (points < 0){
    cout << "Ваш Ваши очки не могут быть отрицательными";
  }
}
