/*Задание 7. Меню ресторана
Что нужно сделать
Напишите программу, которая выводит меню бизнес-ланча ресторана в зависимости от дня недели. В меню есть общая часть, а есть уникальная, которая зависит от дня недели. Пользователь должен ввести номер дня недели — от 1 (понедельник) до 7 (воскресенье), а программа должна вывести на экран день недели и меню этого дня.*/

#include <iostream>
using namespace std;

int main(){
  int weekday;
  cout << "Введите день недели (от 1 до 7): ";
  cin >> weekday;
  if(weekday < 1 || weekday > 7) {
    cout << "Ошибка ввели не верное число";
  }
  
  if (weekday >= 1 && weekday <= 7){
    if ( weekday == 1 ){
      cout << "Меню сегодня (понедельник): \n 1.Гороховый суп \n 2.Салат 'Цезарь' с креветками \n 3.Куриная ножка с пюре \n 4.Морс";
      }
    else if (weekday == 2){
      cout << "Меню сегодня (вторник): \n 1. Борщ \n 2. Пицца Маргарита \n 3. Стейк с картошкой по-деревенски \n 4. Компот";
      }
    else if (weekday == 3) {
      cout << "Меню сегодня (среда): \n 1. Рассольник  \n 2. Салат «Греческий» с оливками \n 3. Стейк с картошкой по-деревенски \n 4. Морс";
    }
    else if (weekday == 4) {
      cout << "Меню сегодня (Четверг): \n 1. Харчо  \n 2. Салат «Оливье» \n 3. Баварские колбаски с капустой \n 4. Морс";
    }
    else if (weekday == 5) {
      cout << "Меню сегодня (Пятница): \n 1. Суп-лапша  \n 2. Салат «Нежность» \n 3. Омлет с овощами \n 4. Морс";
    }
    else if (weekday == 6) {
      cout << "Меню сегодня (Суббота): \n 1. Солянка  \n 2. Салат «Цезарь» с курицей \n 3. Паста Карбонара \n 4. Морс";
    }
    else if (weekday == 7) {
      cout << "Меню сегодня (Воскресенье): \n 1. Окрошка  \n 2. Салат мимоза \n 3. Рыбное филе с рисом \n 4. Морс";
    }
  }
}