/*Задача 2. Обмен местами
Что нужно сделать
Есть код программы с двумя переменными типа int и выводом этих переменных на экран. Напишите программу, которая меняет значения переменных местами, то есть нужно добиться того, чтобы в переменной a лежит значение b, а в b — значение a.*/
#include <iostream>
int main() {
  int a = 42;
  int b = 153;
  std::cout << "a: " << a << "\n"; 
  std::cout << "b: " << b << "\n";
  a = a + b;
  b = a - b;
  a = a - b;
  
  std::cout << "a: " << a << "\n"; 
  std::cout << "b: " << b << "\n";
  
}
