/*Задание 8. Зарплата (дополнительное задание)
Что нужно сделать
В отделе маркетинга работают три сотрудника. Их зарплаты могут быть как разными, так и одинаковыми. Напишите программу, которая вычисляет разницу между самой высокой и самой низкой зарплатами сотрудников, а также среднее арифметическое зарплат всех сотрудников отдела.

Пример

Введите зарплату первого сотрудника: 45 рублей
Введите зарплату второго сотрудника: 45 рублей
Введите зарплату третьего сотрудника: 45 рублей
-----Считаем-----
Самая высокая зарплата в отделе: 45 рублей
Разница между самой высокой и самой низкой зарплатой в отделе: 0 рублей
Средняя зарплата в отделе: 45 рублей

Что оценивается
Правильность нахождения разницы зарплат.
Оптимальность нахождения разницы зарплат.
*/

#include <iostream>
using namespace std;

int main(){
  int staffSalaries1, staffSalaries2, staffSalaries3, difference,arithmeticMean, min, max;
  cout << "Введите зарплату первого сотрудника: ";
  cin >> staffSalaries1;
  cout << "Введите зарплату второго сотрудника: ";
  cin >> staffSalaries2;
  cout << "Введите зарплату третьего сотрудника: ";
  cin >> staffSalaries3;
  if(staffSalaries1 < staffSalaries2){
    min = staffSalaries1;
  }
  else min = staffSalaries2;
  if(min > staffSalaries3){
    min = staffSalaries3;
  }



  if(staffSalaries1 > staffSalaries2){
    max = staffSalaries1;
  }
  else max = staffSalaries2;
  if(max < staffSalaries3){
    max = staffSalaries3;
  }

  cout << "Наименьшее зарпала : " << min << " Наибольшая : " << max << "\n";
  difference = max - min;
  arithmeticMean = (staffSalaries1 + staffSalaries2 + staffSalaries3) / 3;
  cout << "разница между самой высокой и самой низкой зарплатами сотрудников : " << difference << " среднее арифметическое зарплат всех сотрудников отдела. : " << arithmeticMean ;
}