/*
  Задача 4. Барберы (необязательная).

В небольшом городке проживает 18 000 взрослых человек: 9 000 мужчин и 9 000 женщин. Согласно традиции этого городка все мужчины обязаны носить бороду. Один предприимчивый житель открыл сеть барбершопов, чтобы помочь мужчинам ухаживать за их бородами. Однако он никак не может посчитать сколько всего специалистов-барберов для этого нужно. Вам нужно написать программу которая будет рассчитывать сколько мужчин можно постричь во всех барбершопах исходя из следующих данных:

* каждый из 9000 мужчин посещает барбершоп раз в месяц (30 дней)

* один барбер способен обслужить одного клиента за 1 час

* смена барбера — 8 часов

Программа должна спросить сколько мужчин проживает в городе и сколько всего барберов уже работает во всех барбершопах, и посчитать сколько барберов нужно, и если их недостаточно — выдать сообщение об этом. Если барберов достаточно — сказать и об этом.

Подсказка: в конструкции условия можно сравнивать не только переменную с числом, но и две переменные! А еще - целые математические выражения. Например: if (a * b > c) …*/

#include <iostream>
using namespace std;

int main(){
    int mens, barbers;
    cout << "Сколько проживает мужчин в городе? : ";
    cin >> mens;
    cout << "Сколько проживает барберов в городе? : ";
    cin >> barbers;


    int servedCustomersPerMonth = barbers * 8 * 30;// Рассчитываем сколько клиентов все барберы  смогут обслужить за месяц мужчин
    cout << "Колличество людей которые смогут подстричься за 1 месяц : " << servedCustomersPerMonth << "\n";
    if(barbers <= 0){
      cout << "В городе совсем нет барберов, наймите хотя бы 1!  ";
    }
    else if (mens > servedCustomersPerMonth) {
        int neededBarbers = (mens / servedCustomersPerMonth); 
        if(neededBarbers % 2 != 0  ){
          neededBarbers += 1;
        }
        cout << "Барберов не хватит. Вам необходимо ещё " << neededBarbers << " барбера(ов)." << "\n";
    } else {
        cout << "Барберов достаточно.";
    }
}






// ниже пример с хитростью

/*
#include <iostream>
using namespace std;

int main(){
    int mens, barbers;
    cout << "Сколько проживает мужчин в городе? : ";
    cin >> mens;
    cout << "Сколько проживает барберов в городе? : ";
    cin >> barbers;


    int servedCustomersPerMonth = barbers * 8 * 30;// Рассчитываем сколько клиентов все барберы  смогут обслужить за месяц мужчин
    cout << "Колличество людей которые смогут подстричься за 1 месяц : " << servedCustomersPerMonth << "\n";
    if(barbers <= 0){
      cout << "В городе совсем нет барберов, наймите хотя бы 1!  ";
    }
    else if (mens > servedCustomersPerMonth) {
        int neededBarbers = mens / servedCustomersPerMonth; 
        float XXX = (float)mens / (float)servedCustomersPerMonth;
        if(neededBarbers % 2 != 0 && XXX > 1.5 ){
          neededBarbers += 1;
        }
        cout << "Барберов не хватит. Вам необходимо ещё " << neededBarbers << " барбер(ов)." << "\n";
    } else {
        cout << "Барберов достаточно.";
    }
}
*/