/*Задание 2. Складываем в уме
Что нужно сделать
Напишите программу которая проверяет то, как вы умеете складывать два числа в уме. Программа должна выводить два разных сообщения на верный и неверный ответ пользователя. В последнем случае надо показывать правильный результат.*/

#include <iostream>
using namespace std;

int main(){
  int a,b,sumUser, sum;
  cout << "Введите первое число ";
  cin >> a;
  cout << "Введите второе число ";
  cin >>  b;
  cout << "Введите их сумму ";
  cin >> sumUser;
  sum = a+b;
  if(sum==sumUser){
    cout << "Ответ верный! ";
    }
  else {
    cout << "Ошибка, правильный ответ : " << sum;
    }
  }
