/*Задание 5. Кратность числа
Что нужно сделать
Напишите программу, которая проверяет, делится ли одно число на другое без остатка.
Советы и рекомендации
Не забудьте про отрицательные числа.
Учитывайте правила деления чисел.*/

#include <iostream>
using namespace std;

int main(){
  int a,b;
  cout << "Введите первое число: ";
  cin >> a;
  cout << "Введите второе число: ";
  cin >> b;
  cout << "-----Проверяем----- "<< "\n";
  if (b == 0){
    cout << ":ERROR::ERROR::ERROR:: На 0 делить нельзя! " << "\n";
  }
  else if (a%b == 0){
    cout << " Да , " << a << " делится на "  << b << " без остатка " << "\n";
  }
  else if(a%b != 0){
    cout << " Нет , " << a << " НЕ делится на "  << b << " без остатка " << "\n";
  }
}
