/*Задание 4. Банкомат — 2
Что нужно сделать
Напишите программу для банкомата.

Условие:

Однажды Вася подошёл к банкомату и захотел обналичить N рублей. 

В банкомате есть купюры достоинством 100, 200, 500, 1 000, 2 000 и 5 000 рублей. Банкомат хочет выдать Васе запрошенную сумму, обойдясь как можно меньшим числом купюр.

Напишите программу для банкомата, которая по заданному числу N: 

решает, сколько купюр каждого номинала нужно выдать (4 по 200, 1 по 1 000) для получения суммы ровно N рублей; 
либо говорит, что выдать ровно N рублей невозможно, например если N не делится на 100.
Учтите, что банкомат не может выдать за один раз более 150 000 рублей. 

При попытке запросить такую сумму должно быть выдано сообщение об ошибке. Например, 800 рублей нужно выдать как 1 по 500, 1 по 200 и ещё 1 по 100.

Советы и рекомендации
Используйте как деление, так и получение остатка от деления.
Постарайтесь выдать самый оптимальный набор купюр.
Помните, что банкомат не может выдать за один раз более 150 000 рублей
*/
#include <iostream>
using namespace std;

int main() {
    int needCash, maxSumLimit = 150000; // Максимальный лимит снятия
    int billValue5000 = 0, billValue2000 = 0, billValue1000 = 0, billValue500 = 0, billValue200 = 0, billValue100 = 0; // Количество купюр каждого номинала

    cout << "\nДобрый день! Вас приветствует Банкомат!\n**************************************************\n\n";
    cout << "Введите нужную сумму для снятия: ";
    cin >> needCash;
    cout << "\nМИНУТКУ...\n";

    // Проверяем, корректна ли запрашиваемая сумма
    if (needCash % 100 != 0 || needCash <= 0 || needCash > maxSumLimit) {
        cout << "Такую сумму выдать нельзя. Введите сумму кратную 100р, но не более: " << maxSumLimit;
        return 0;
    }

    // Распределяем сумму по купюрам, начиная с наибольшего номинала
    billValue5000 = needCash / 5000;
    needCash %= 5000;

    billValue2000 = needCash / 2000;
    needCash %= 2000;

    billValue1000 = needCash / 1000;
    needCash %= 1000;

    billValue500 = needCash / 500;
    needCash %= 500;

    billValue200 = needCash / 200;
    needCash %= 200;

    billValue100 = needCash / 100;
    needCash %= 100;

    cout << "\nВам выдали:\n";
    if (billValue5000 > 0) cout << "Купюры по 5000: " << billValue5000 << " шт\n";
    if (billValue2000 > 0) cout << "Купюры по 2000: " << billValue2000 << " шт\n";
    if (billValue1000 > 0) cout << "Купюры по 1000: " << billValue1000 << " шт\n";
    if (billValue500 > 0) cout << "Купюры по 500: " << billValue500 << " шт\n";
    if (billValue200 > 0) cout << "Купюры по 200: " << billValue200 << " шт\n";
    if (billValue100 > 0) cout << "Купюры по 100: " << billValue100 << " шт\n";

    return 0;
}